app/controllers/campaigns_controller.rb

INSERT INTO "campaigns" ("title", "description", "user_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @campaign = Campaign.new(campaign_params)

    respond_to do |format|
      if @campaign.save

UPDATE "campaigns" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "campaigns"."id" = $4  [["title", "minima"], ["description", "Placeat illo tenetur dolorem distinctio est non."], ["updated_at", "2018-02-09 02:36:10.089829"], ["id", 27]]
---
  def update
    respond_to do |format|
      if @campaign.update(campaign_params)

DELETE FROM "campaigns" WHERE "campaigns"."id" = $1  [["id", 12]]
---
  def destroy
    @campaign.destroy

SELECT COUNT(*) FROM "members" WHERE "members"."campaign_id" = $1  [["campaign_id", 17]]
---
  def raffle
    respond_to do |format|
      if @campaign.status != "pending"
        format.json { render json: 'Esta campanha já foi sorteada', status: :unprocessable_entity }
      elsif @campaign.members.count < 3